{
  "INVALID_CREDENTIALS": "Invalid email or password. Please check your credentials and try again.",
  "USER_NOT_FOUND": "User account not found. Please check your email address.",
  "ACCOUNT_DISABLED": "Your account has been disabled. Please contact support.",
  "ACCOUNT_LOCKED": "Your account has been locked due to multiple failed login attempts. Please try again later or contact support.",
  "EMAIL_NOT_VERIFIED": "Please verify your email address before logging in. Check your inbox for the verification link.",
  "EMAIL_ALREADY_EXISTS": "An account with this email address already exists.",
  "WEAK_PASSWORD": "Password does not meet security requirements. Please use a stronger password.",
  "INVALID_TOKEN": "Your session has expired. Please log in again.",
  "TOKEN_EXPIRED": "Your authentication token has expired. Please log in again.",
  "PERMISSION_DENIED": "You don't have permission to perform this action.",
  "RESOURCE_NOT_FOUND": "The requested resource was not found.",
  "VALIDATION_ERROR": "Please check your input and try again.",
  "SERVER_ERROR": "An unexpected server error occurred. Please try again later.",
  "NETWORK_ERROR": "Unable to connect to the server. Please check your internet connection.",
  "RATE_LIMIT_EXCEEDED": "Too many requests. Please wait a moment and try again.",
  "REGISTRATION_FAILED": "Registration failed. Please try again.",
  "PASSWORD_RESET_FAILED": "Password reset failed. Please try again or contact support.",
  "PROFILE_UPDATE_FAILED": "Failed to update profile. Please try again.",
  "DUPLICATE_ENTRY": "This entry already exists in the system.",
  "INVALID_INPUT": "Invalid input provided. Please check your data.",
  "UNAUTHORIZED": "You are not authorized to access this resource.",
  "FORBIDDEN": "Access to this resource is forbidden.",
  "BAD_REQUEST": "Invalid request. Please check your input.",
  "INTERNAL_ERROR": "An internal error occurred. Please contact support if the problem persists.",
  "SERVICE_UNAVAILABLE": "Service is temporarily unavailable. Please try again later.",
  "TIMEOUT": "Request timed out. Please try again.",
  "UNKNOWN_ERROR": "An unexpected error occurred. Please try again.",
  "DEFAULT": "Something went wrong. Please try again later."
}
